{
"filename":"2/2024/SBEC",
"Questions": [
    {
        "Question": [
            "Whether the view of legal consultant is correct as per the provisions of the Companies Act ?"
        ],
        "Context": "MEDCO Ltd. was incorporated on 20th March, 2023, as a public limited company with the main objective to provide the consultancy services to businesses in Medical Sector, including supply of medical professional through outsourcing. The Board of Directors in its meeting held on 16th June, 2024 approved the proposal to change the main object to start medical service with nominal charges by setting up hospitals, health centres and medical institutions for charitable purposes in interest of general public. The members of the Company also approved the proposal and accordingly application for conversion of the company into section 8 company is prepared. However, legal consultant opined that company must be running the business at least for 3 years prior to such application.",
        "Marks": "(5 marks)"
    },
    {
        "Question": [
            "What additional matters to be considered by Registrar of the Companies, in case of conversion of the existing company into section 8 Company, as per MCA Notification no. G.S.R. 42(E) dated January 19, 2023."
        ],
        "Context": "MEDCO Ltd. was incorporated on 20th March, 2023, as a public limited company with the main objective to provide the consultancy services to businesses in Medical Sector, including supply of medical professional through outsourcing. The Board of Directors in its meeting held on 16th June, 2024 approved the proposal to change the main object to start medical service with nominal charges by setting up hospitals, health centres and medical institutions for charitable purposes in interest of general public. The members of the Company also approved the proposal and accordingly application for conversion of the company into section 8 company is prepared. However, legal consultant opined that company must be running the business at least for 3 years prior to such application.",
        "Marks": "(5 marks)"
    },
    {
        "Question": [
            "Micro India Ltd. is in Mobile Manufacturing business, incorporated under the Companies Act. The Company has agreement with Chinese Company for technology support as well as supply of major parts of mobile which are assembled in India. Under this treaty, there is a clause, where the Indian Company needs to setup a business in Hong Kong, China to setup production unit of Mobile Chipset as well as manufacturing of Display Panel.",
            "Describe the procedure for incorporation of Company in Hong Kong (China)."
        ],
        "Context": "Micro India Ltd. is in Mobile Manufacturing business, incorporated under the Companies Act. The Company has agreement with Chinese Company for technology support as well as supply of major parts of mobile which are assembled in India. Under this treaty, there is a clause, where the Indian Company needs to setup a business in Hong Kong, China to setup production unit of Mobile Chipset as well as manufacturing of Display Panel.",
        "Marks": "(5 marks)"
    },
    {
        "Question": [
            "“Rule 39 of the Companies (Incorporation) Rules, 2014, stipulates the detailed provision for conversion of Company Limited by Guarantee into a Company Limited by Shares.”",
            "In view of the above statement, highlight the procedure for such conversion."
        ],
        "Context": "“Rule 39 of the Companies (Incorporation) Rules, 2014, stipulates the detailed provision for conversion of Company Limited by Guarantee into a Company Limited by Shares.”",
        "Marks": "(4 marks)"
    },
    {
        "Question": [
            "In view of such situation, whether proposal of opening of branch office can be implemented. Answer with the applicable provisions of the law."
        ],
        "Context": "ABC was incorporated as Nidhi Company in year 2001. Since inception of the Company, it operates only through its single head office situated in Hyderabad. In the Meeting of the Members, few members residing in Mumbai, proposed that branch office of the Company be opened in territory of Maharashtra. However, there are no objection from other members as the majority of them had already relocated in different part of the nation.",
        "Marks": "(4 marks)"
    },
    {
        "Question": [
            "What are the important points to be kept in mind while applying for getting status of Dormant."
        ],
        "Context": "To minimize the legal compliances, Companies, which are not operating any business activity, are applying for status of Dormant.",
        "Marks": "(4 marks)"
    },
        {
        "Question": [
            "The Company is planning for an IPO. As advised by the legal consultant, the Company needs to alter its capital clause.",
            "Prepare a note on types of alteration of capital clause in Memorandum and Articles of Association."
        ],
        "Context": "FGR Ltd. was incorporated on 3rd March 1959, with Authorised Capital of ` 15 Lakh (divided into 1 lakh equity share of ` 15 each). Since the inception, authorised capital was increased from time to time and as on date the Authorised Capital of the Company is ` 90 Crore (6 Crore equity share of ` 15 each). The paid-up capital of the Company is ` 60 Crore (divided into 4 Crore equity share of ` 15 each)",
        "Marks": "(4 marks)"
    },
        {
        "Question": [
            "Define the term “Start Up”. What are the provisions in the Companies Act, with respect to issue of sweat equity shares by Start Up Companies ?"
        ],
        "Context": null,
        "Marks": "(4 marks)"
    },
    {
        "Question": [
            "Divya-Jyoti Sansthan is a registered Company under section 8 of the Companies Act, 2013, to operate eye hospital in various places of India for charitable purpose. The Sansthan received an offer of huge grant/donation from Madela Foundation, USA, for techno-oriented medical services in India with better quality.",
            "What are the conditions under FCRA, 2010, with respect to acceptance of foreign grant/donation ?"
        ],
        "Context": "Divya-Jyoti Sansthan is a registered Company under section 8 of the Companies Act, 2013, to operate eye hospital in various places of India for charitable purpose. The Sansthan received an offer of huge grant/donation from Madela Foundation, USA, for techno-oriented medical services in India with better quality.",
        "Marks": "(3 marks each)"
    },
        {
        "Question": [
            "Given these circumstances, highlight the relevant legal provisions to apply for dormant status."
        ],
        "Context": "EVG Ltd. was incorporated on 5th October, 2019, with main objective to manufacture the Lithium Power Batteries. The securities of Company are listed on Bombay Stock Exchange under SME Category. Due to restriction on the import of raw material, there is no business activity since previous 2 financial years. The Company is debt free Company and facing no pending inquiries. Also, there is no statutory dues pending for payment. The Management seeks to apply for dormant company status under the provisions of the Companies Act, 2013.",
        "Marks": "(3 marks)"
    },
    {
        "Question": [
            "‘Strike off provisions gives a choice or an option to non-working companies to remove its name from the Register of Companies. There are many companies which are registered with ROC but due to various reasons they are not operative. The strike off provisions gives an option to such companies to apply to ROC for removal of their name from the Register of Companies.’",
            "In light of above statement and applicable provisions of the Law, which types of the Companies cannot be removed under section 248(1) and (2) of the Companies Act, 2013 ?"
        ],
        "Context": "‘Strike off provisions gives a choice or an option to non-working companies to remove its name from the Register of Companies. There are many companies which are registered with ROC but due to various reasons they are not operative. The strike off provisions gives an option to such companies to apply to ROC for removal of their name from the Register of Companies.’",
        "Marks": "(3 marks)"
    },
    {
        "Question": [
            "Explain the grounds for winding up of a company by the National Company Law Tribunal (NCLT)."
        ],
        "Context": null,
        "Marks": "(3 marks)"
    },
    {
        "Question": [
            "The other partners now want to restore the name of RC & TC LLP with jurisdictional RoC. What are the steps to be taken ?"
        ],
        "Context": "RC & TC LLP was incorporated on 8th May, 2022, with 5 partners. All partners are qualified professionals and have identified profit sharing in the partnership. One of the partners, by forged signature, applied for striking off the name of LLP, without informing any other partner. He was an active partner and looking after all compliances with statutory authorities.\nRoC inadvertently removed the name of the LLP. One of the partners was informed by his friend about such action by RoC.",
        "Marks": "(3 marks)"
    },
    {
        "Question": [
            "Prepare a brief note on Companies (Winding up) Rules, 2020, notified by MCA."
        ],
        "Context": null,
        "Marks": "(3 marks)"
    },
    {
        "Question": [
            "Evaluate whether InnoTrans Ltd. can proceed with voluntary liquidation under the Insolvency and Bankruptcy Code, 2016, in this scenario. Additionally, list the required documents that must accompany the declaration for initiating voluntary liquidation."
        ],
        "Context": "InnoTrans Ltd. is seeking to commence a voluntary liquidation process. A declaration on affidavit was provided by one of the company’s directors, confirming that a thorough review of the company’s financial affairs has been completed. However, the affidavit does not include a declaration of solvency.",
        "Marks": "(5 marks)"
    }
]
}